Revit 2024 API
TextEditorOptions Methods
The TextEditorOptions type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetTextEditorOptions
 Returns the current Revit instance's TextEditorOptions.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
TextEditorOptions Class
Autodesk.Revit.UI Namespace